{
  "projects": {
    "section": {
      "title": "Последние проекты",
      "projectCardHint": "Нажмите на изображение, чтобы узнать детали"
    },

    "sections": {
      "overview": "Обзор проекта",
      "whatIBuilt": "Что реализовано",
      "challenges": "Задачи и решения",
      "challenge": "Задача",
      "solution": "Решение",
      "stack": "Стек технологий",
      "links": "Ссылки"
    },

    "portfolio": {
      "title": "Интерактивное портфолио",
      "modalTitle": "Современное анимированное портфолио на React с продуманной архитектурой и интерактивным UI",
      "alt": "Человек печатает на ноутбуке с графиками и диаграммами аналитики. Рядом на деревянном столе стоит ваза с розовыми розами, мягкий дневной свет.",
      "overview": "Это портфолио — не просто лендинг, а полноценный фронтенд-проект, демонстрирующий мой подход к архитектуре интерфейсов, анимациям, структуре контента и интерактивному поведению. Цель — создать личный сайт, который выглядит профессионально, масштабируется по функциональности и прозрачно отражает мой инженерный уровень.",
      "whatIBuilt": [
        "Компонентно-ориентированная архитектура на React и TypeScript с чётким разделением ответственности",
        "Модульная файловая структура, вдохновлённая Feature-Sliced Design, для масштабируемости и изоляции доменов",
        "Переиспользуемые UI-блоки: кнопки, сетки, карточки, модальные окна, layout-компоненты",
        "Мультиязычная поддержка (i18n) с синхронизацией `lang` в HTML и отдельным шрифтом для кириллицы",
        "Анимации, управляемые состоянием и скроллом: GSAP для интро и scroll-driven эффектов, Framer Motion для интерактивных модалок",
        "Scroll-driven анимация карточек проектов с подсказкой 'Смотреть', привязанной к курсору",
        "Модальное окно с блокировкой скролла контента при открытии и детальной презентацией проекта",
        "Форма связи с EmailJS для отправки сообщений без backend’а, с клиентской валидацией, мультиязычной поддержкой и модальным окном результата отправки",
        "Полностью адаптивный макет для всех размеров экранов (небольшие исправления для Safari/iOS: SVG-иконки, модальные окна, header, секция hero, тултипы в футере)",
        "Возможность скачать резюме на трёх языках",
        "Семантическая и доступная разметка с учётом UX и ARIA",
        "Кастомные визуалы для каждого проекта",
        "Проект полностью покрыт юнит-, интеграционными и end-to-end (Playwright) тестами, обеспечивая корректность интерфейса и поведения скролла/анимаций"
      ],
      "challenges": [
        {
          "challenge": "Обеспечить корректную поддержку нескольких языков с синхронизацией `lang` в HTML и отдельным шрифтом для кириллицы.",
          "solution": "Структурировала переводы с использованием namespaces и создала конфигурационный слой проектов, изолированный от UI-логики, что упростило поддержку мультиязычности, масштабирование контента и корректное отображение кириллицы."
        },
        {
          "challenge": "Создать плавные scroll-driven анимации карточек проектов на всех экранах, с интерактивной подсказкой 'Смотреть', привязанной к курсору.",
          "solution": "Использовала GSAP matchMedia и отдельные таймлайны для мобильных, планшетов и десктопов, а подсказка реализована через отслеживание позиции курсора для плавного и отзывчивого UX."
        },
        {
          "challenge": "Dropdown меню в секции Skills перекрывались и нарушали UX при вертикальном стэкинге кнопок.",
          "solution": "Использовала React Portals, чтобы рендерить подменю поверх других элементов, сохраняя правильный z-index и предотвращая проблемы с доступностью и навигацией."
        },
        {
          "challenge": "Сделать рабочую контактную форму без собственного бэкенда, с валидацией, мультиязычностью и корректной обработкой ошибок.",
          "solution": "Использовала EmailJS для отправки писем через облачный сервис, подключила личный кабинет и почту. Добавила клиентскую валидацию через Zod, модальное окно для отображения результата и блокировку кнопки на время отправки, чтобы UX был плавным и безопасным."
        }
      ],
      "stack": "React 19, TypeScript, GSAP, Framer Motion, i18n, EmailJS, Jest, React Testing Library, Playwright, Vite, SCSS / CSS Modules"
    },

    "fintrack": {
      "title": "FinTrack",
      "modalTitle": "SPA для управления расходами, аналитикой и личным бюджетом",
      "alt": "Ноутбук с кодом на деревянном столе рядом с блокнотом, ручкой, очками, чашкой кофе, растением и стопкой бумаги с надписью `Hello World`.",
      "overview": "Проект начинался как компактный фронтенд-прототип, но в процессе разработки был осознанно расширен до полноценного приложения с аутентификацией, аналитикой, CRUD-операциями и модульной архитектурой. Я реализовала две версии проекта — demo и full-stack — чтобы показать как чистую SPA-архитектуру, так и работу с кастомным backend-слоем, включая аутентификацию, управление сессиями и серверную бизнес-логику.",
      "whatIBuilt": [
        "Архитектура Feature-Sliced Design с чётким разделением доменов и изоляцией слоёв",
        "Полный цикл аутентификации: login, register, demo-пользователь, refresh-токены и устойчивые сессии",
        "Сложный UI с таблицами, фильтрацией, формами и модальными окнами",
        "Аналитика расходов: графики, виджеты и фильтрация по категориям и датам",
        "Полный CRUD для транзакций и категорий с реактивными обновлениями состояния",
        "Кастомный backend-слой на Node.js (json-server-auth) с JWT-аутентификацией, refresh-токенами, soft-delete и серверной фильтрацией",
        "CI/CD-пайплайн: тестирование, линтинг, сборка и деплой на Vercel",
        "Покрытие тестами: Jest + RTL, unit, snapshot и интеграционные тесты, мок API/store, полностью изолировано от бэкенда"
      ],
      "challenges": [
        {
          "challenge": "Обеспечить безопасное и устойчивое хранение сессий при использовании json-server-auth, который не поддерживает refresh-токены из коробки.",
          "solution": "Расширила серверную логику: реализовала кастомный endpoint для обновления токенов, ротацию refresh-токенов и синхронизацию состояния сессии на клиенте."
        },
        {
          "challenge": "Избежать лишних перерендеров и сохранить отзывчивость интерфейса при работе с большим объёмом данных.",
          "solution": "Перестроила управление состоянием на Zustand с селекторными подписками, что позволило локализовать обновления и снизить нагрузку на UI."
        },
        {
          "challenge": "Сохранить масштабируемость и читаемость кодовой базы по мере роста функциональности.",
          "solution": "Внедрила Feature-Sliced Design с изолированными слоями, доменно-ориентированными модулями и переиспользуемыми UI-компонентами."
        }
      ],
      "stack": "React 19, TypeScript, Zustand, Node.js, json-server-auth, Recharts, Framer Motion, Vite, Jest, React Testing Library"
    },

    "briaton": {
      "title": "Каталог Briaton",
      "modalTitle": "Интерактивный каталог товаров",
      "alt": "Слабо освещённый ресторан с расставленными столами, стульями с обивкой, бокалами и свечами — создаётся уютная и изящная атмосфера.",
      "overview": "Интерактивный веб-каталог для онлайн-магазина освещения, разработанный как тестовое задание для digital-студии AffArts. Проект фокусируется на чистой JavaScript-логике, динамическом рендеринге данных и живых UI-взаимодействиях без использования фреймворков. Адаптивная вёрстка намеренно вынесена в отдельный проект портфолио — здесь акцент именно на JavaScript-функциональности.",
      "whatIBuilt": [
        "Динамический рендеринг карточек товаров из JSON-данных",
        "Фильтрация товаров по типу и наличию, сортировка по цене и популярности",
        "Пагинация для работы с большим каталогом",
        "Интерактивная корзина: добавление, удаление товаров и пересчёт общей стоимости",
        "Отображение наличия товаров по городам с помощью тултипов",
        "Слайдер «Товары дня» на Swiper.js",
        "FAQ-аккордеон с управлением состоянием",
        "Валидация и отправка форм с отображением success/error-модалок",
        "Модульная структура JavaScript-кода для удобной поддержки и расширения"
      ],
      "challenges": [
        {
          "challenge": "Организовать сложную клиентскую логику без использования фреймворков.",
          "solution": "Разбила функциональность на независимые модули и компоненты, разделив ответственность между каталогом, корзиной, фильтрами и UI-элементами."
        },
        {
          "challenge": "Обеспечить отзывчивый и понятный интерфейс при большом количестве интерактивных элементов.",
          "solution": "Использовала сторонние библиотеки (Swiper.js, Tippy.js, JustValidate) и связала их с собственной бизнес-логикой через чистый JavaScript."
        },
        {
          "challenge": "Синхронизировать состояние каталога, фильтров и корзины без глобального стейта.",
          "solution": "Построила управление состоянием через локальные структуры данных и контролируемые обновления DOM."
        }
      ],
      "stack": "Vanilla JS, SCSS, Swiper.js, Tippy.js, JustValidate"
    },

    "pawtastic": {
      "title": "Pawtastic",
      "modalTitle": "Pixel Perfect адаптивный лендинг",
      "alt": "Пара обнимает щенка золотистого ретривера, лица близко друг к другу, мягко улыбаются. Тёплая и уютная обстановка передаёт радость и нежность.",
      "overview": "Адаптивная главная страница онлайн-зоомагазина, реализованная на чистом HTML и SCSS с акцентом на Pixel Perfect, семантику, доступность и производительность. Проект выполнен по дизайн-макету Figma и разработан в рамках профессионального курса с прохождением код-ревью, баг-листов и требований заказчика.",
      "whatIBuilt": [
        "Pixel Perfect-вёрстка по макету Figma (допуск ±10px)",
        "Полностью адаптивный и эластичный layout от 360px до 4000px",
        "Семантическая HTML5-разметка с учётом доступности",
        "SCSS-архитектура с использованием BEM и модульной структуры",
        "Flexbox и CSS Grid для построения адаптивных сеток",
        "Анимации и hover-эффекты без потери производительности",
        "Оптимизация изображений для Retina-дисплеев и lazy loading",
        "SVG-спрайты и оптимизация векторной графики",
        "Подготовка проекта к высоким Lighthouse-показателям"
      ],
      "challenges": [
        {
          "challenge": "Сохранить Pixel Perfect-точность на экранах от мобильных устройств до ультрашироких мониторов.",
          "solution": "Построила эластичную систему сеток на Flexbox и CSS Grid с продуманными контейнерами и адаптивными отступами."
        },
        {
          "challenge": "Обеспечить высокую производительность при наличии анимаций и графики.",
          "solution": "Использовала GPU-ускоренные CSS-переходы, оптимизированные изображения и заранее заданные размеры медиа для предотвращения layout shift."
        },
        {
          "challenge": "Соблюсти требования доступности без ущерба для визуального дизайна.",
          "solution": "Применила семантические теги, aria-атрибуты, корректные focus-состояния и предсказуемые интерактивные зоны."
        }
      ],
      "stack": "HTML5, SCSS, BEM"
    }
  }
}
